app/views/statics/_news.html.erb

</fieldset>
<% Post.all.each do |post| %>
---
SELECT "posts".* FROM "posts"