app/views/posts/index.html.erb

SELECT "posts".* FROM "posts"
---
  </fieldset>
    <% Post.all.each do |post| %>