app/controllers/line_items_controller.rb

  def create
    picture = Picture.find(params[:picture_id])
    @line_item = @cart.add_product(picture.id)

    respond_to do |format|
      if @line_item.save
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = $1 LIMIT 1  [["id", 3]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-04-10 06:00:51.148712"], ["updated_at", "2015-04-10 06:00:51.148712"]]
INSERT INTO "line_items" ("picture_id", "cart_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["picture_id", 3], ["cart_id", 1], ["created_at", "2015-04-10 06:00:51.265389"], ["updated_at", "2015-04-10 06:00:51.265389"]]
UPDATE "line_items" SET "quantity" = $1, "updated_at" = $2 WHERE "line_items"."id" = $3  [["quantity", 2], ["updated_at", "2015-04-10 19:29:02.654343"], ["id", 3]]