app/controllers/orders_controller.rb

  def new
    if @cart.line_items.empty?
---
SELECT  1 AS one FROM "line_items" WHERE "line_items"."cart_id" = $1 LIMIT 1  [["cart_id", 8]]

  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)
    @order.status = "open"

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2015-04-11 04:28:32.469214"], ["updated_at", "2015-04-11 04:28:32.469214"]]
INSERT INTO "orders" ("name", "adress", "email", "pay_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "dani"], ["adress", "diese"], ["email", "dada@google.com"], ["pay_type", "Rechnung"], ["created_at", "2015-04-11 02:13:36.343169"], ["updated_at", "2015-04-11 02:13:36.343169"]]
DELETE FROM "carts" WHERE "carts"."id" = $1  [["id", 8]]