app/controllers/pictures_controller.rb

  def shop
    @pictures = Picture.where(for_sale: true)
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."for_sale" = 't'

  def show
    @picture = @theme.pictures.find(params[:id])
    @verspictures = Picture.where(name: @picture.name)
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."theme_id" = $1 AND "pictures"."id" = $2 LIMIT 1  [["theme_id", 1], ["id", 0]]
SELECT "pictures".* FROM "pictures" WHERE "pictures"."name" = $1  [["name", "Intim 1"]]

  def edit
    @picture = @theme.pictures.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."theme_id" = $1 AND "pictures"."id" = $2 LIMIT 1  [["theme_id", 1], ["id", 2]]

  def create
    @picture = @theme.pictures.build(picture_params)


        if @picture.save
---
INSERT INTO "pictures" ("name", "count", "url", "theme_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @picture = @theme.pictures.find(params[:id])
     if @picture.update_attributes(picture_params)
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."theme_id" = $1 AND "pictures"."id" = $2 LIMIT 1  [["theme_id", 1], ["id", 1]]
UPDATE "pictures" SET "url" = $1, "updated_at" = $2 WHERE "pictures"."id" = $3  [["url", "#<ActionDispatch::Http::UploadedFile:0x007f78096be238>"], ["updated_at", "2015-04-08 16:22:51.469379"], ["id", 1]]

    def find_theme
      @theme = Theme.find(params[:theme_id])
---
SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT 1  [["id", nil]]