app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Test Post"], ["content", "ganz viel dinge"], ["created_at", "2015-04-12 05:47:01.322381"], ["updated_at", "2015-04-12 05:47:01.322381"]]
---
	def create
		@post = Post.new(post_params)

	    respond_to do |format|
	      if @post.save

UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3
---
	def update
		respond_to do |format|
	      if @post.update(theme_params)