app/controllers/themes_controller.rb

SELECT "themes".* FROM "themes"
---
  def index
    @themes = Theme.all

INSERT INTO "themes" ("name", "size", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Intim"], ["size", 6], ["created_at", "2015-04-08 04:27:32.819185"], ["updated_at", "2015-04-08 04:27:32.819185"]]
---
  def create
    @theme = Theme.new(theme_params)

    respond_to do |format|
      if @theme.save

DELETE FROM "themes" WHERE "themes"."id" = $1  [["id", 980190962]]
---
  def destroy
    @theme.destroy

SELECT  "themes".* FROM "themes" WHERE "themes"."id" = $1 LIMIT 1  [["id", 980190962]]
---
    def set_theme
      @theme = Theme.find(params[:id])